# Brewfile
brew "cask"
tap "homebrew/cask"
tap "homebrew/cask-fonts"
cask_args appdir: '/Applications'

brew "fzf"
brew "mackup"
brew "mas"
brew "tmux"
brew "zsh"
brew "zsh-autosuggestions"

cask "font-meslolg-nerd-font"

cask "google-chrome"
cask "google-backup-and-sync"
cask "iterm2"
cask "mysides"

mas "BetterSnapTool", id:417375580
mas "Dashlane", id:552383089
mas "Theine", id:955848755
mas "Things", id:904280696
# Xcode takes too long to install. Not the right time for this
#mas "Xcode", id:497799835
