# Brewfile
brew "cask"
tap "homebrew/cask"
tap "homebrew/cask-fonts"
tap "homebrew/cask-drivers"
cask_args appdir: '/Applications'

brew "dockutil"
brew "fzf"
brew "hub"
brew "mas"
brew "pre-commit"
brew "shellcheck"
brew "shfmt"
brew "tmux"
brew "zsh"
brew "zsh-autosuggestions"

cask "font-meslo-lg-nerd-font"

cask "alfred"
cask "disk-inventory-x"
cask "firefox"
cask "google-chrome"
cask "homebrew/cask-versions/firefox-developer-edition"
cask "logitech-options"
cask "multifirefox"
cask "iterm2"
cask "mysides"
cask "witch"
