# Brewfile
brew "cask"
tap "homebrew/cask"
tap "miguelandres/homebrew-tap"
tap "homebrew/cask-fonts"
tap "spotify/public"
cask_args appdir: '/Applications'

# Moved to Brewfile_mas since it doesn't work on gh actions
# brew "go"
brew "alda"
brew "dezoomify-rs"
brew "exiftool"
brew "graphviz"
brew "jupyterlab"
brew "markdownlint-cli"
brew "nodejs"
brew "openssl"
# Eww, this is because of php in alfred workflows
brew "php"
brew "pre-commit"
brew "pylint"
brew "python"
brew "python3"
brew "rustup"
brew "sbt"
brew "scala"
brew "scio"
brew "vim"
brew "yapf" #python formatter

cask "discord"
cask "github"
cask "jupyter-notebook-ql"
cask "jupyter-notebook-viewer"
cask "netnewswire"
cask "signal"
cask "spotify"
cask "steam"
cask "visual-studio-code"
cask "vlc"

cask "android-commandlinetools"
cask "android-studio"
