# Brewfile
brew "cask"
tap "homebrew/cask"
tap "homebrew/cask-fonts"
cask_args appdir: '/Applications'

# Moved to Brewfile_mas since it doesn't work on gh actions
# brew "go"
brew "graphviz"
brew "jupyterlab"
brew "markdownlint-cli"
brew "nodejs"
brew "pre-commit"
brew "pylint"
brew "python"
brew "python3"
brew "rust"
brew "sbt"
brew "scala"
brew "vim"
brew "yapf" #python formatter

cask "discord"
cask "github"
cask "jupyter-notebook-ql"
cask "jupyter-notebook-viewer"
cask "netnewswire"
cask "signal"
cask "spotify"
cask "steam"
cask "visual-studio-code"
cask "vlc"
